# Filename: ~/github/dotfiles-latest/brew/00-base/Brewfile
# https://github.com/linkarzu/dotfiles-latest/blob/main/brew/00-base/Brewfile

# Adding taps (repos) on top as I was getting errors
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "homebrew/cask-fonts"

brew "neovim"
brew "font-hack-nerd-font"
brew "wget"
brew "coreutils"
brew "fzf"
brew "git"
brew "ripgrep"
brew "nvm"
brew "starship"
brew "tmux"
brew "tree"
brew "watch"
brew "bat"
brew "fd"
brew "zoxide"
